app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
      @recipes = Recipe.paginate(page: params[:page], per_page: 5)

SELECT "chefs".* FROM "chefs" ORDER BY "chefs"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "chef_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = Chef.first
    if @recipe.save

UPDATE "recipes" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "updated recipe name"], ["description", "updated recipe description"], ["updated_at", "2023-01-22 15:58:44.108361"], ["id", 980190963]]
---
  def update

    if@recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 980190963]]
---
  def destroy
    Recipe.find(params[:id]).destroy

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
---
  def set_recipe
    @recipe= Recipe.find(params[:id])